12/data/attachments/c1703057314b7b1e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_tend_Friend_57546_9</nif:username>
            <nif:friendToBeRequested>soap_friends_3754447f-dfc3-47cd-b37d-4449d64219da</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>